# Dotfiles Dependencies Brewfile
# Usage: brew bundle

# Taps
tap "homebrew/bundle"

# Essential tools
brew "zsh"
brew "tmux"
brew "starship"
brew "fzf"
brew "eza"
brew "zoxide"
brew "direnv"
brew "git"
brew "neovim"
brew "bat"
brew "ripgrep"
brew "fd"
brew "tree"
brew "wget"
brew "curl"

# Development tools
brew "asdf"
brew "zplug"

# Optional but useful
brew "thefuck"
brew "hstr"
brew "terminal-notifier"
brew "timer"

# GUI Applications (optional)
cask "coteditor" if OS.mac?

# Fonts
cask "font-hack-nerd-font" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac? 